app/views/things/_form.html.erb

		<td><%= f.label :category_id %></td>
	    <td><%= f.select :category_id, Category.all.map { | category | [category.name, category.id]}, :prompt => 'Select category' %></td>
---
SELECT "categories".* FROM "categories"