app/views/things/index.html.erb

SELECT "things".* FROM "things" WHERE ("things"."user_id" = 1)
---
<% thing_list = Thing.find_all_by_user_id(current_user.id) %>

SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "things" WHERE (category_id = 1)) AS subquery
---
				}
			},
			colors: <%= raw Category.all.map { | cat | cat.background_color }.inspect %>,
			series: [
			{
				type: 'pie',
				name: 'Browser share',
				data: <%= raw Category.all.map{ |cat| [Category.find(cat.id).name, Thing.count_by_category(cat.id)] }.inspect %>

			}]