app/views/things/show.html.erb

SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
---
  <b>Category:</b>
  <%= Category.find(@thing.category_id).name %>