app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
---
  def show
    @category = Category.find(params[:id])

SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO "categories" ("background_color", "created_at", "description", "name", "text_color", "updated_at") VALUES ('#fd3c', '2010-12-10 18:48:50.513734', 'zxczxczxc', 'Category 004', '#fcfcfc', '2010-12-10 18:48:50.513734')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
UPDATE "categories" SET "description" = 'TestCategoryDescription', "name" = 'TestCategoryName', "updated_at" = '2010-11-19 22:44:27.348527' WHERE ("categories"."id" = 980190962)
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
DELETE FROM "categories" WHERE ("categories"."id" = 1)
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy