app/controllers/things_controller.rb

SELECT "things".* FROM "things"
---
  def index
    @things = Thing.all

SELECT "things".* FROM "things" WHERE ("things"."id" = 1) LIMIT 1
---
  def show
    @thing = Thing.find(params[:id])

SELECT "things".* FROM "things" WHERE ("things"."id" = 3) LIMIT 1
---
  def edit
    @thing = Thing.find(params[:id])

INSERT INTO "things" ("adquired", "category_id", "created_at", "description", "name", "price", "updated_at", "user_id") VALUES ('2010-12-13 00:00:00.000000', 2, '2010-12-14 22:06:34.259901', 'czxzxczxczxc', 'ccc', 0.0, '2010-12-14 22:06:34.259901', 1)
---
  def create
    @thing = Thing.new(params[:thing])
    @thing.user_id = current_user.id

    respond_to do |format|
      if @thing.save

SELECT "things".* FROM "things" WHERE ("things"."id" = 3) LIMIT 1
UPDATE "things" SET "adquired" = '2010-12-19 00:00:00.000000', "description" = '', "updated_at" = '2010-12-11 00:16:30.056569' WHERE ("things"."id" = 1)
---
  def update
    @thing = Thing.find(params[:id])

    respond_to do |format|
      if @thing.update_attributes(params[:thing])

SELECT "things".* FROM "things" WHERE ("things"."id" = 2) LIMIT 1
DELETE FROM "things" WHERE ("things"."id" = 2)
---
  def destroy
    @thing = Thing.find(params[:id])
    @thing.destroy